Autodesk.Revit.DB.FamilyType.HasValue(Autodesk.Revit.DB.FamilyParameter)
Indicates if this family parameter has an assigned value or not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the input argument-"familyParameter"-is invalid.

Autodesk.Revit.DB.FamilyType.AsValueString(Autodesk.Revit.DB.FamilyParameter)
Provides access to value as a string with unit in the given family parameter.
Returns: The string that represents the parameter value with unit.
Remarks: The method only applies to parameters of value types. If the parameter has no value or does not contain a numeric value,
the method returns null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the input argument-"familyParameter"-is invalid.

Autodesk.Revit.DB.FamilyType.AsElementId(Autodesk.Revit.DB.FamilyParameter)
Provides access to the Autodesk::Revit::DB::ElementId^ stored in the given family parameter.
Returns: The Autodesk::Revit::DB::ElementId^ contained in the parameter.Returns an invalid element id
if the storage type of the input argument is Autodesk::Revit::DB::ElementId^ type or this parameter has no value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the input argument-"familyParameter"-is invalid,

Autodesk.Revit.DB.FamilyType.AsDouble(Autodesk.Revit.DB.FamilyParameter)
Provides access to the double precision number of the given family parameter.
Returns: The double value contained in the parameter. Returns null
if the storage type of the input argument is not double type or this parameter has no value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the input argument-"familyParameter"-is invalid,

Autodesk.Revit.DB.FamilyType.AsInteger(Autodesk.Revit.DB.FamilyParameter)
Provides access to the integer number of the given family parameter.
Returns: The integer value contained in the parameter. Returns null
if the storage type of the input argument is not integer type or this parameter has no value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the input argument-"familyParameter"-is invalid,

Autodesk.Revit.DB.FamilyType.AsString(Autodesk.Revit.DB.FamilyParameter)
Provides access to the string contents of the given family parameter.
Returns: The string contained in the parameter. Returns null if the storage type of the input
argument is not string type or this parameter has no value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"familyParameter"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the input argument-"familyParameter"-is invalid,

Autodesk.Revit.DB.FamilyType.Name
The name of the family type.

Autodesk.Revit.DB.FamilyType
The family type object provides read access to the values of family parameters for this type.